{
  "metadata": {
    "video_id": "Nr7vbOSzpSk",
    "url": "https://www.youtube.com/watch?v=Nr7vbOSzpSk",
    "title": "How to Pass Tier 1 & 2 Selections Part 1/3: Difference Between Tier 1 & 2",
    "channel": "The Stoic Viking",
    "channel_id": "UCg5EWI7X2cyS98C8hQwDCcw",
    "published_at": "2025-06-27 10:32:46",
    "duration": 293,
    "view_count": 8032,
    "like_count": null,
    "comment_count": null,
    "description": "📌 Part 1 of 3: The Difference Between Tier 1 and Tier 2 Units – How to Pass Special Operations Selections\n\nWelcome to Part 1 of my three-part series on how to pass Tier 1 and Tier 2 selections in U.S. Special Operations.\n\nBefore you can even think about surviving selection, you need to understand what you're preparing for. Too many people say they want to go “Tier 1” without knowing what that even means. This video is all about laying out the real differences between Tier 1 and Tier 2 units, so you know exactly what you’re getting into—and why it matters.\n\n🔎 What’s the difference?\nTier 2 units are elite, but they’re designed for broader special operations missions. These include:\n✅ Army Special Forces (Green Berets)\n✅ 75th Ranger Regiment\n✅ Navy SEAL Teams\n✅ Marine Raiders (MARSOC)\n✅ Air Force Special Tactics\n\nThese units train hard, deploy constantly, and often work in small teams advising partners, conducting raids, or preparing the battlespace for larger missions.\n\nTier 1 units, on the other hand, are the nation’s most secretive, specialized, and capable counterterror and hostage rescue forces:\n✅ Delta Force (CAG)\n✅ SEAL Team 6 (DEVGRU)\n✅ Intelligence Support Activity \n\nTheir selection is even more grueling, and their training pipelines are longer, with a focus on direct action, surgical strikes, and high-value target capture or kill missions. These units are given priority funding, access to cutting-edge technology, and often work with the highest-level intelligence to conduct missions that other units simply can’t.\n\n⚡ Why is this important?\nBecause your preparation must match your target. Tier 2 selections test your ability to operate in small teams, endure physically demanding tasks, and show leadership under stress. Tier 1 selections go further—they strip away the team support and evaluate you as an individual problem-solver under relentless pressure.\n\nIf you don't understand these differences, you'll train for the wrong fight.\n\n👊 Coming Up Next:\nPart 2 – How to Pass Tier 2 Selections\nPart 3 – How to Pass Tier 1 Selections\n\nIf you have questions, thoughts, or your own experiences, drop them in the comments—I read everything. And make sure you subscribe so you don’t miss the next parts of this series.\n\nThanks for watching—and train smart.\n\n#Tier1 #Tier2 #SpecialForces #SOF #MilitarySelection #HowToPassSelection #GreenBerets #NavySEALs #DeltaForce #DEVGRU #Ranger #MARSOC #USMilitary #SpecOps #MilitaryAdvice #VeteranTips #MilitaryTraining #SpecialOperations",
    "tags": [
      "special forces",
      "Navy Seals",
      "Green Berets",
      "Marsoc Raiders",
      "Rangers",
      "Delta Force",
      "Seal Team 6",
      "DEVGRU",
      "Intelligence Support Activity"
    ],
    "entities": [],
    "relationships": []
  },
  "transcript": {
    "full_text": "This is part one of a three-part series of how to pass Tier one and Tier two selections. Part one will be covering the differences between Tier one and Tier two units and also with a focus on how they do selections differently.\n\nFirst, to cover my background, I'm former Special Forces, a tier one operator, and after I passed selection, about four years after I passed selection, I had the honor and the privilege to actually be a cadre/instructor for a tier one selection. So I got to see not only, I was behind the scenes and I got to see actually how these selections work um, from the back side.\n\nSo, so first, how what's the difference between tier one and two? So first of all, let's cover some colloquialisms. You're going to hear White SOF versus Black SOF. Your White SOF is your Tier two guys, which is your Rangers, your Special Forces, your MARSOC Raiders, your uh, Marine Force Recon, and your SEALs. Quick caveat with SEALs. There's two types of SEALs. There's two levels of SEALs. You have your JV SEALs, your varsity SEALs, your white side SEALs, your black side SEALs. Most SEALs that you meet, whether it's any SEAL team other than SEAL Team 6, are your white side SEALs, your vanilla SEALs. We also commonly refer to them as the JV SEALs. Your SEAL team 6 is an entire another organization, about five times, if not larger, than any other actual SEAL team because they have three to four times as many operators and they have like five to 10 times more support staff. So, so that's the difference, all right? And your tier one units, all right, your three main operational tier one units, which are designed after uh organizational structures designed after the British SAS. They have squadrons and they have troops, is your Delta Force, your um, DevGru or SEAL Team 6, and a not as well commonly known unit is known as the Intelligence Support Activity.\n\nAnd there are a couple adjacent units, uh, like the 24th STS, which are is your Air Force Special Operations. They have your JTACs, they have your TAC Ps, your forward air controls, your pararescue. So these guys are they support not only tier two but also tier one elements. I've served along JTACs in both tier two and tier one. And I actually, I love the AFSOC guys. They're amazing, but I'm not quite completely sure of how they how their selection process works and who they determine who gets to go to support tier two elements versus tier one elements. So the biggest difference between tier two and tier one selections is you're all your white soft, your tier two, their selections are going to be where they're yelling at you, they're screaming at you, they're getting in your face. They are trying to break you mentally and they have a lot more team oriented events. Tier one, they actually don't yell at you. They don't give you any negative reinforcement, but they don't give you any positive reinforcement. And I'll talk more later at the tier one selection video of why that is. And then also almost all their events are completely individual. You have very few to no team events in the tier one selections.\n\nAnd also another colloquialism that you're going to commonly hear is about assaulters or operators. So when you go to one of these units, especially the tier one units, you can either go to selection as a support personnel or as an operator, which also commonly known is, especially in SEAL team six or Delta, are also known as assaulters. So these are your operators, these are the guys who are on the ground who are doing, you know, the main stuff, and then everybody else is essentially a support personnel.\n\nAnd then these three operational tier one units, we also another colloquialism is used, is we use the Task Force colors, which we were using in the early 2000s, probably into the mid-2000s. Occasionally still use them when we're trying to determine who is who because a lot of times we'll go into meetings with other tier one elements and we're not in uniform. So as we're trying to figure out who is who, because these units commonly change their operational names, we'll be kind of figure out who is who and then we'll be like, are you this color? Are you that color? So the three main colors for the three tier one units, uh, Delta Force is green, SEAL Team 6 is blue, and the activity is orange, or commonly known as TFO.\n\nSo I hope this was educational. Tomorrow, I will put out part two of how tier two selections are generally run and what you need to know and what to do in order to help you pass a tier two selection. And then the part three will be about tier one and the differences, how they do their selections and how they, um, the best ways and advice that I have to pass them as well. So, hope this was informative. If you guys have any comments, complaints, questions, uh, just leave a comment. And just remember, at the end of the day, this is my opinion. Nothing more than that. So if you disagree with my opinion, I got nothing for you. All right, appreciate you guys.",
    "segments": [
      {
        "start": 0.0,
        "end": 32.56,
        "text": "This is part one of a three-part series of how to pass Tier one and Tier two selections. Part one will be covering the differences between Tier one and Tier two units and also with a focus on how they do selections differently. First, to cover my background, I'm former Special Forces, a tier one operator, and after I passed selection, about four years after I passed selection, I had the honor and the privilege to actually be a cadre/instructor for a tier one selection. So I got to see not only, I was behind the scenes and I got to"
      },
      {
        "start": 32.48,
        "end": 65.04,
        "text": "see actually how these selections work um, from the back side. So, so first, how what's the difference between tier one and two? So first of all, let's cover some colloquialisms. You're going to hear White SOF versus Black SOF. Your White SOF is your Tier two guys, which is your Rangers, your Special Forces, your MARSOC Raiders, your uh, Marine Force Recon, and your SEALs. Quick caveat with SEALs. There's two types of SEALs. There's two levels of SEALs. You have your JV SEALs, your varsity SEALs, your white side SEALs, your black side SEALs. Most SEALs that you meet,"
      },
      {
        "start": 64.97,
        "end": 97.52,
        "text": "whether it's any SEAL team other than SEAL Team 6, are your white side SEALs, your vanilla SEALs. We also commonly refer to them as the JV SEALs. Your SEAL team 6 is an entire another organization, about five times, if not larger, than any other actual SEAL team because they have three to four times as many operators and they have like five to 10 times more support staff. So, so that's the difference, all right? And your tier one units, all right, your three main operational tier one units, which are designed after uh organizational structures designed after the"
      },
      {
        "start": 97.45,
        "end": 130.01,
        "text": "British SAS. They have squadrons and they have troops, is your Delta Force, your um, DevGru or SEAL Team 6, and a not as well commonly known unit is known as the Intelligence Support Activity. And there are a couple adjacent units, uh, like the 24th STS, which are is your Air Force Special Operations. They have your JTACs, they have your TAC Ps, your forward air controls, your pararescue. So these guys are they support not only tier two but also tier one elements. I've served along JTACs in both tier two and tier one. And I actually, I love"
      },
      {
        "start": 129.94,
        "end": 162.49,
        "text": "the AFSOC guys. They're amazing, but I'm not quite completely sure of how they how their selection process works and who they determine who gets to go to support tier two elements versus tier one elements. So the biggest difference between tier two and tier one selections is you're all your white soft, your tier two, their selections are going to be where they're yelling at you, they're screaming at you, they're getting in your face. They are trying to break you mentally and they have a lot more team oriented events. Tier one, they actually don't yell at you. They"
      },
      {
        "start": 162.42,
        "end": 194.98,
        "text": "don't give you any negative reinforcement, but they don't give you any positive reinforcement. And I'll talk more later at the tier one selection video of why that is. And then also almost all their events are completely individual. You have very few to no team events in the tier one selections. And also another colloquialism that you're going to commonly hear is about assaulters or operators. So when you go to one of these units, especially the tier one units, you can either go to selection as a support personnel or as an operator, which also commonly known is, especially"
      },
      {
        "start": 194.9,
        "end": 227.46,
        "text": "in SEAL team six or Delta, are also known as assaulters. So these are your operators, these are the guys who are on the ground who are doing, you know, the main stuff, and then everybody else is essentially a support personnel. And then these three operational tier one units, we also another colloquialism is used, is we use the Task Force colors, which we were using in the early 2000s, probably into the mid-2000s. Occasionally still use them when we're trying to determine who is who because a lot of times we'll go into meetings with other tier one elements"
      },
      {
        "start": 227.39,
        "end": 259.94,
        "text": "and we're not in uniform. So as we're trying to figure out who is who, because these units commonly change their operational names, we'll be kind of figure out who is who and then we'll be like, are you this color? Are you that color? So the three main colors for the three tier one units, uh, Delta Force is green, SEAL Team 6 is blue, and the activity is orange, or commonly known as TFO. So I hope this was educational. Tomorrow, I will put out part two of how tier two selections are generally run and what you need"
      },
      {
        "start": 259.87,
        "end": 292.43,
        "text": "to know and what to do in order to help you pass a tier two selection. And then the part three will be about tier one and the differences, how they do their selections and how they, um, the best ways and advice that I have to pass them as well. So, hope this was informative. If you guys have any comments, complaints, questions, uh, just leave a comment. And just remember, at the end of the day, this is my opinion. Nothing more than that. So if you disagree with my opinion, I got nothing for you. All right, appreciate"
      },
      {
        "start": 292.36,
        "end": 293,
        "text": "you guys."
      }
    ],
    "language": "en",
    "raw_transcript": null
  },
  "entities": [],
  "relationships": [],
  "key_points": [
    {
      "text": "The three main operational Tier one units are Delta Force, DevGru (SEAL Team 6), and the Intelligence Support Activity.",
      "importance": 0.98,
      "context": null
    },
    {
      "text": "Tier two selections use negative reinforcement like yelling and screaming, while Tier one selections use no reinforcement (positive or negative) and are almost entirely individual events.",
      "importance": 0.97,
      "context": null
    },
    {
      "text": "Tier one units use Task Force colors for identification: Green for Delta Force, Blue for SEAL Team 6, and Orange for the Intelligence Support Activity.",
      "importance": 0.96,
      "context": null
    },
    {
      "text": "Tier two units, also called 'White SOF', include Rangers, Special Forces, MARSOC Raiders, Marine Force Recon, and non-Team 6 SEALs.",
      "importance": 0.95,
      "context": null
    },
    {
      "text": "Tier one units are organizationally modeled after the British SAS, using squadrons and troops.",
      "importance": 0.94,
      "context": null
    },
    {
      "text": "SEAL Team 6 is a distinct organization, about five times larger than other SEAL teams with significantly more operators and support staff.",
      "importance": 0.93,
      "context": null
    },
    {
      "text": "The speaker is a former Tier one operator and Special Forces soldier who also served as an instructor/cadre for a Tier one selection.",
      "importance": 0.92,
      "context": null
    },
    {
      "text": "Regular SEAL teams are referred to as 'white side', 'vanilla', or 'JV SEALs', while SEAL Team 6 are 'black side' or 'Varsity SEALs'.",
      "importance": 0.9,
      "context": null
    },
    {
      "text": "The 24th STS (Air Force Special Operations) provides support elements like JTACs and Pararescue to both Tier one and Tier two units.",
      "importance": 0.88,
      "context": null
    },
    {
      "text": "Tier two selections have a much higher emphasis on team-oriented events compared to the individual focus of Tier one.",
      "importance": 0.87,
      "context": null
    },
    {
      "text": "Personnel within Tier one units are categorized as either 'operators' (also called 'assaulters') or 'support personnel'.",
      "importance": 0.85,
      "context": null
    },
    {
      "text": "This video is the first of a three-part series on how to pass Tier one and Tier two selections.",
      "importance": 0.82,
      "context": null
    },
    {
      "text": "The speaker is unsure of the specific selection process for 24th STS and how they assign personnel to support Tier 1 vs Tier 2 units.",
      "importance": 0.8,
      "context": null
    },
    {
      "text": "Part two of the series will focus on Tier two selections, and Part three will focus on Tier one selections.",
      "importance": 0.78,
      "context": null
    },
    {
      "text": "The colloquialism 'Black SOF' refers to Tier one units.",
      "importance": 0.75,
      "context": null
    },
    {
      "text": "Task Force colors were used in the early to mid-2000s and are still occasionally used for identification in inter-unit meetings.",
      "importance": 0.7,
      "context": null
    }
  ],
  "topics": [
    {
      "name": "US Special Operations Forces",
      "confidence": 0.8
    },
    {
      "name": "Military Selection and Assessment",
      "confidence": 0.8
    },
    {
      "name": "Tier One Units",
      "confidence": 0.8
    },
    {
      "name": "Tier Two Units",
      "confidence": 0.8
    },
    {
      "name": "Military Organization and Structure",
      "confidence": 0.8
    },
    {
      "name": "Special Operations Terminology",
      "confidence": 0.8
    }
  ],
  "summary": "This transcript is part one of a three-part series from a former Special Forces and Tier one operator who also served as an instructor for a Tier one selection. The video provides a detailed breakdown of the distinctions between U.S. Special Operations Forces (SOF), specifically Tier one and Tier two units, and outlines the fundamental differences in their respective selection processes. The speaker aims to clarify common colloquialisms and provide a foundational understanding for future installments that will offer advice on passing these rigorous assessments.\n\nThe core of the analysis differentiates between 'White SOF' (Tier two) and 'Black SOF' (Tier one). Tier two units, such as Army Rangers, Special Forces, MARSOC Raiders, and most Navy SEALs, are characterized by a selection process that involves intense psychological pressure, including yelling and screaming, and is heavily focused on team-oriented events. In stark contrast, Tier one selections for units like Delta Force, SEAL Team 6 (DevGru), and the Intelligence Support Activity are almost entirely individual-based. They eschew any form of reinforcement, either positive or negative, creating a unique and self-driven testing environment.\n\nSeveral key organizational and terminological details are clarified. The three main operational Tier one units are modeled after the British SAS, using a squadron and troop structure. The speaker also decodes the Task Force color system used for identification in the early-to-mid 2000s: Green for Delta Force, Blue for SEAL Team 6, and Orange for the Intelligence Support Activity (TFO). He distinguishes between 'operators' or 'assaulters'—the primary mission personnel—and the extensive support staff, noting that SEAL Team 6 is a vastly larger organization than any other SEAL team. The video concludes by setting the stage for part two, which will cover Tier two selections, and part three, which will delve into Tier one selections.",
  "sentiment": null,
  "knowledge_graph": null,
  "dates": [
    {
      "confidence": 0.9,
      "normalized_date": "2002-07-01",
      "original_text": "early 2000s",
      "precision": "approximate",
      "context": "The period when Task Force colors were initially used for Tier one units."
    },
    {
      "confidence": 0.85,
      "normalized_date": "2005-07-01",
      "original_text": "mid-2000s",
      "precision": "approximate",
      "context": "The period into which the use of Task Force colors continued."
    },
    {
      "confidence": 0.8,
      "normalized_date": "2024-07-24",
      "original_text": "Tomorrow",
      "precision": "day",
      "context": "The scheduled release date for part two of the video series, relative to the creation of the transcript."
    }
  ],
  "temporal_references": [],
  "processing_stats": {
    "gemini_entities": [
      {
        "confidence": 0.98,
        "name": "The Speaker",
        "type": "PERSON"
      },
      {
        "confidence": 0.95,
        "name": "Former Special Forces operator",
        "type": "PERSON"
      },
      {
        "confidence": 0.95,
        "name": "Tier one operator",
        "type": "PERSON"
      },
      {
        "confidence": 0.95,
        "name": "Cadre/Instructor for a tier one selection",
        "type": "PERSON"
      },
      {
        "confidence": 0.9,
        "name": "Tier two guys",
        "type": "PERSON"
      },
      {
        "confidence": 0.92,
        "name": "Rangers (personnel)",
        "type": "PERSON"
      },
      {
        "confidence": 0.92,
        "name": "Special Forces (personnel)",
        "type": "PERSON"
      },
      {
        "confidence": 0.92,
        "name": "MARSOC Raiders (personnel)",
        "type": "PERSON"
      },
      {
        "confidence": 0.92,
        "name": "Marine Force Recon (personnel)",
        "type": "PERSON"
      },
      {
        "confidence": 0.92,
        "name": "SEALs (personnel)",
        "type": "PERSON"
      },
      {
        "confidence": 0.9,
        "name": "JV SEALs",
        "type": "PERSON"
      },
      {
        "confidence": 0.9,
        "name": "Varsity SEALs",
        "type": "PERSON"
      },
      {
        "confidence": 0.9,
        "name": "White side SEALs",
        "type": "PERSON"
      },
      {
        "confidence": 0.9,
        "name": "Black side SEALs",
        "type": "PERSON"
      },
      {
        "confidence": 0.9,
        "name": "Operators",
        "type": "PERSON"
      },
      {
        "confidence": 0.9,
        "name": "Support staff",
        "type": "PERSON"
      },
      {
        "confidence": 0.92,
        "name": "JTACs",
        "type": "PERSON"
      },
      {
        "confidence": 0.92,
        "name": "TAC Ps",
        "type": "PERSON"
      },
      {
        "confidence": 0.92,
        "name": "Forward air controls",
        "type": "PERSON"
      },
      {
        "confidence": 0.92,
        "name": "Pararescue",
        "type": "PERSON"
      },
      {
        "confidence": 0.9,
        "name": "AFSOC guys",
        "type": "PERSON"
      },
      {
        "confidence": 0.9,
        "name": "Support personnel",
        "type": "PERSON"
      },
      {
        "confidence": 0.9,
        "name": "Assaulters",
        "type": "PERSON"
      },
      {
        "confidence": 0.96,
        "name": "Tier one units",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.96,
        "name": "Tier two units",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.95,
        "name": "Special Forces",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.95,
        "name": "Rangers",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.95,
        "name": "MARSOC Raiders",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.95,
        "name": "Marine Force Recon",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.95,
        "name": "SEALs",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.98,
        "name": "SEAL Team 6",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.98,
        "name": "DevGru",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.93,
        "name": "JV SEALs (group)",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.93,
        "name": "Varsity SEALs (group)",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.93,
        "name": "White side SEALs (group)",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.93,
        "name": "Black side SEALs (group)",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.95,
        "name": "White SOF",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.95,
        "name": "Black SOF",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.97,
        "name": "British SAS",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.88,
        "name": "Squadrons",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.88,
        "name": "Troops",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.98,
        "name": "Delta Force",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.98,
        "name": "Intelligence Support Activity",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.96,
        "name": "24th STS",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.96,
        "name": "Air Force Special Operations",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.94,
        "name": "Task Force Green",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.94,
        "name": "Task Force Blue",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.94,
        "name": "Task Force Orange",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.94,
        "name": "TFO",
        "type": "ORGANIZATION"
      },
      {
        "confidence": 0.95,
        "name": "Tier one selection",
        "type": "EVENT"
      },
      {
        "confidence": 0.95,
        "name": "Tier two selection",
        "type": "EVENT"
      },
      {
        "confidence": 0.9,
        "name": "Part one of three-part series",
        "type": "EVENT"
      },
      {
        "confidence": 0.9,
        "name": "Part two of three-part series",
        "type": "EVENT"
      },
      {
        "confidence": 0.9,
        "name": "Part three of three-part series",
        "type": "EVENT"
      }
    ],
    "gemini_relationships": [
      {
        "confidence": 0.98,
        "object": "former Tier one operator",
        "predicate": "has_background_as",
        "subject": "The Speaker"
      },
      {
        "confidence": 0.98,
        "object": "Tier one selection",
        "predicate": "was_instructor_for",
        "subject": "The Speaker"
      },
      {
        "confidence": 0.97,
        "object": "White SOF",
        "predicate": "are_colloquially_known_as",
        "subject": "Tier two units"
      },
      {
        "confidence": 0.97,
        "object": "Black SOF",
        "predicate": "are_colloquially_known_as",
        "subject": "Tier one units"
      },
      {
        "confidence": 0.96,
        "object": "Delta Force",
        "predicate": "is_a_type_of",
        "subject": "Tier one units"
      },
      {
        "confidence": 0.96,
        "object": "SEAL Team 6",
        "predicate": "is_a_type_of",
        "subject": "Tier one units"
      },
      {
        "confidence": 0.96,
        "object": "Intelligence Support Activity",
        "predicate": "is_a_type_of",
        "subject": "Tier one units"
      },
      {
        "confidence": 0.95,
        "object": "Rangers",
        "predicate": "is_a_type_of",
        "subject": "Tier two units"
      },
      {
        "confidence": 0.95,
        "object": "Special Forces",
        "predicate": "is_a_type_of",
        "subject": "Tier two units"
      },
      {
        "confidence": 0.95,
        "object": "MARSOC Raiders",
        "predicate": "is_a_type_of",
        "subject": "Tier two units"
      },
      {
        "confidence": 0.95,
        "object": "Marine Force Recon",
        "predicate": "is_a_type_of",
        "subject": "Tier two units"
      },
      {
        "confidence": 0.95,
        "object": "SEALs",
        "predicate": "is_a_type_of",
        "subject": "Tier two units"
      },
      {
        "confidence": 0.95,
        "object": "British SAS",
        "predicate": "is_organizational_model_for",
        "subject": "Tier one units"
      },
      {
        "confidence": 0.9,
        "object": "Squadrons",
        "predicate": "has_subunit",
        "subject": "British SAS"
      },
      {
        "confidence": 0.9,
        "object": "Troops",
        "predicate": "has_subunit",
        "subject": "British SAS"
      },
      {
        "confidence": 0.9,
        "object": "Squadrons",
        "predicate": "has_subunit",
        "subject": "Tier one units"
      },
      {
        "confidence": 0.9,
        "object": "Troops",
        "predicate": "has_subunit",
        "subject": "Tier one units"
      },
      {
        "confidence": 0.98,
        "object": "SEAL Team 6",
        "predicate": "is_also_known_as",
        "subject": "DevGru"
      },
      {
        "confidence": 0.93,
        "object": "Varsity SEALs",
        "predicate": "is_colloquially_known_as",
        "subject": "Black side SEALs"
      },
      {
        "confidence": 0.93,
        "object": "JV SEALs",
        "predicate": "is_colloquially_known_as",
        "subject": "White side SEALs"
      },
      {
        "confidence": 0.92,
        "object": "other SEAL teams",
        "predicate": "is_five_times_larger_than",
        "subject": "SEAL Team 6"
      },
      {
        "confidence": 0.9,
        "object": "operators",
        "predicate": "has_3_to_4_times_more",
        "subject": "SEAL Team 6"
      },
      {
        "confidence": 0.9,
        "object": "support staff",
        "predicate": "has_5_to_10_times_more",
        "subject": "SEAL Team 6"
      },
      {
        "confidence": 0.96,
        "object": "Air Force Special Operations",
        "predicate": "is_part_of",
        "subject": "24th STS"
      },
      {
        "confidence": 0.94,
        "object": "Tier one units",
        "predicate": "supports",
        "subject": "24th STS"
      },
      {
        "confidence": 0.94,
        "object": "Tier two units",
        "predicate": "supports",
        "subject": "24th STS"
      },
      {
        "confidence": 0.92,
        "object": "JTACs",
        "predicate": "provides",
        "subject": "24th STS"
      },
      {
        "confidence": 0.92,
        "object": "Pararescue",
        "predicate": "provides",
        "subject": "24th STS"
      },
      {
        "confidence": 0.96,
        "object": "yelling and screaming",
        "predicate": "is_characterized_by",
        "subject": "Tier two selection"
      },
      {
        "confidence": 0.96,
        "object": "team-oriented events",
        "predicate": "is_characterized_by",
        "subject": "Tier two selection"
      },
      {
        "confidence": 0.96,
        "object": "individual events",
        "predicate": "is_characterized_by",
        "subject": "Tier one selection"
      },
      {
        "confidence": 0.96,
        "object": "no positive or negative reinforcement",
        "predicate": "is_characterized_by",
        "subject": "Tier one selection"
      },
      {
        "confidence": 0.92,
        "object": "Assaulters",
        "predicate": "are_also_known_as",
        "subject": "Operators"
      },
      {
        "confidence": 0.9,
        "object": "Operators",
        "predicate": "has_personnel_type",
        "subject": "Tier one units"
      },
      {
        "confidence": 0.9,
        "object": "Support personnel",
        "predicate": "has_personnel_type",
        "subject": "Tier one units"
      },
      {
        "confidence": 0.98,
        "object": "Green",
        "predicate": "has_assigned_color",
        "subject": "Delta Force"
      },
      {
        "confidence": 0.98,
        "object": "Blue",
        "predicate": "has_assigned_color",
        "subject": "SEAL Team 6"
      },
      {
        "confidence": 0.98,
        "object": "Orange",
        "predicate": "has_assigned_color",
        "subject": "Intelligence Support Activity"
      },
      {
        "confidence": 0.94,
        "object": "Task Force Green",
        "predicate": "is_referred_to_as",
        "subject": "Delta Force"
      },
      {
        "confidence": 0.94,
        "object": "Task Force Blue",
        "predicate": "is_referred_to_as",
        "subject": "SEAL Team 6"
      },
      {
        "confidence": 0.94,
        "object": "Task Force Orange",
        "predicate": "is_referred_to_as",
        "subject": "Intelligence Support Activity"
      },
      {
        "confidence": 0.94,
        "object": "TFO",
        "predicate": "is_also_known_as",
        "subject": "Task Force Orange"
      },
      {
        "confidence": 0.85,
        "object": "Tier one and Tier two selections",
        "predicate": "is_topic_of",
        "subject": "Part one of three-part series"
      },
      {
        "confidence": 0.85,
        "object": "Tier two selection",
        "predicate": "is_topic_of",
        "subject": "Part two of three-part series"
      },
      {
        "confidence": 0.85,
        "object": "Tier one selection",
        "predicate": "is_topic_of",
        "subject": "Part three of three-part series"
      }
    ],
    "timeline_events": [],
    "visual_temporal_cues": [],
    "temporal_patterns": [],
    "dates": [
      {
        "confidence": 0.9,
        "normalized_date": "2002-07-01",
        "original_text": "early 2000s",
        "precision": "approximate",
        "context": "The period when Task Force colors were initially used for Tier one units."
      },
      {
        "confidence": 0.85,
        "normalized_date": "2005-07-01",
        "original_text": "mid-2000s",
        "precision": "approximate",
        "context": "The period into which the use of Task Force colors continued."
      },
      {
        "confidence": 0.8,
        "normalized_date": "2024-07-24",
        "original_text": "Tomorrow",
        "precision": "day",
        "context": "The scheduled release date for part two of the video series, relative to the creation of the transcript."
      }
    ],
    "visual_dates": [],
    "retention_decision": {
      "action": "deleted",
      "video_path": "cache/How to Pass Tier 1 & 2 Selections Part 1⧸3： Difference Between Tier 1 & 2-Nr7vbOSzpSk.mp3",
      "video_hash": "df25bbd20e0d1d28f8ed1c5c378e54c1",
      "reason": "Policy: Always delete source videos",
      "cost_savings": {
        "storage_cost_avoided": 0.0018055778592824937,
        "reprocessing_cost": 0.0184164234375
      },
      "timestamp": "2025-07-25T15:22:34.497758"
    }
  },
  "processing_cost": 0.016742203125,
  "processing_time": 0.0,
  "timeline_v2": {
    "events": [],
    "chapters": [],
    "quality_metrics": {
      "total_events_extracted": 0,
      "events_after_deduplication": 0,
      "events_with_content_dates": 0,
      "final_high_quality_events": 0,
      "chapters_created": 0,
      "quality_improvement_ratio": 0
    },
    "status": "discontinued",
    "message": "Timeline features discontinued - focusing on core intelligence extraction"
  }
}